openfoam/rotstQuarter-steady/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -1);

boundaryField
{
    rotor
    {
type rotatingWallVelocity;
origin (0 0 0);
axis (0 0 1);
omega 1;
    }
    rotor2
    {
type rotatingWallVelocity;
origin (0 0 0);
axis (0 0 1);
omega 1;
    }
    rotor3
    {
type rotatingWallVelocity;
origin (0 0 0);
axis (0 0 1);
omega 1;
    }


    stator
    {
	type noSlip;
    }
    stator2
    {
	type noSlip;
    }
    stator3
    {
	type noSlip;
    }



    shroud1
    {
        //type            fixedValue;
       //value           uniform (0 0 0);
	//type slip;
	type noSlip;
type rotatingWallVelocity;
origin (0 0 0);
axis (0 0 1);
omega 1;

    }
    shroud2
    {
        //type            fixedValue;
       //value           uniform (0 0 0);
	//type slip;
	type noSlip;
type rotatingWallVelocity;
origin (0 0 0);
axis (0 0 1);
omega 1;

    }



    inlet1
    {
        type            cyclic;


    }

    outlet1
    {

        type            cyclic;

    }
    inlet2
    {
        type            cyclic;


    }

    outlet2
    {

        type            cyclic;

    }


}

// ************************************************************************* //
