openfoam/rotstQuarter-steady/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    rotor
    {
        type            zeroGradient;
    }
    rotor2
    {
        type            zeroGradient;
    }
    rotor3
    {
        type            zeroGradient;
    }

    stator
    {
        type            zeroGradient;
    }
    stator2
    {
        type            zeroGradient;
    }
    stator3
    {
        type            zeroGradient;
    }

    shroud1
    {
        type            zeroGradient;
    }
    shroud2
    {
        type            zeroGradient;
    }

    inlet1
    {
        type            cyclic;

    }
   outlet1
    {
        type            cyclic;

    }
    inlet2
    {
        type            cyclic;

    }
   outlet2
    {
        type            cyclic;

    }



}

// ************************************************************************* //
